export type SubDataType = {
  year: number;
  desc: string;
};


export type DataType = {
  startYear: number;
  endYear: number;

name: string;
  subData: SubDataType[];
}[];

export const data: DataType = [
  {
    startYear: 1673,
    endYear: 1920,
    name: "Физика",
    subData: [
      {
        year: 1673,
        desc: "В 1673 году вышла книга Христиана Гюйгенса «Часы с маятником». В ней Гюйгенс приводит (словесно) ",
      },
      {
        year: 1821,
        desc: "К концу XVIII века в активе физики электромагнитных явлений были уже теория атмосферного электричества",
      },
      {
        year: 1873,
        desc: "Силы, введённые Ампером, как и у Ньютона, считались дальнодействующими",
      },
      {
        year: 1907,
        desc: "В статье 1905 года Эйнштейн рассмотрел два постулата: всеобщий принцип ",
      },
    ],
  },
  {
    startYear: 1673,
    endYear: 1920,
    name: "Физика",
    subData: [
      {
        year: 1673,
        desc: "В 1673 году вышла книга Христиана Гюйгенса «Часы с маятником». В ней Гюйгенс приводит (словесно) ",
      },
      {
        year: 1821,
        desc: "К концу XVIII века в активе физики электромагнитных явлений были уже теория атмосферного электричества",
      },
      {
        year: 1873,
        desc: "Силы, введённые Ампером, как и у Ньютона, считались дальнодействующими",
      },
      {
        year: 1907,
        desc: "В статье 1905 года Эйнштейн рассмотрел два постулата: всеобщий принцип ",
      },
    ],
  },
  {
    startYear: 1673,
    endYear: 1920,
    name: "Физика",
    subData: [
      {
        year: 1673,
        desc: "В 1673 году вышла книга Христиана Гюйгенса «Часы с маятником». В ней Гюйгенс приводит (словесно) ",
      },
      {
        year: 1821,
        desc: "К концу XVIII века в активе физики электромагнитных явлений были уже теория атмосферного электричества",
      },
      {
        year: 1873,
        desc: "Силы, введённые Ампером, как и у Ньютона, считались дальнодействующими",
      },
      {
        year: 1907,
        desc: "В статье 1905 года Эйнштейн рассмотрел два постулата: всеобщий принцип ",
      },
    ],
  },
  {
    startYear: 1673,
    endYear: 1920,
    name: "Физика",
    subData: [
      {
        year: 1673,
        desc: "В 1673 году вышла книга Христиана Гюйгенса «Часы с маятником». В ней Гюйгенс приводит (словесно) ",
      },
      {
        year: 1821,
        desc: "К концу XVIII века в активе физики электромагнитных явлений были уже теория атмосферного электричества",
      },
      {
        year: 1873,
        desc: "Силы, введённые Ампером, как и у Ньютона, считались дальнодействующими",
      },
      {
        year: 1907,
        desc: "В статье 1905 года Эйнштейн рассмотрел два постулата: всеобщий принцип ",
      },
    ],
  },
  {
    startYear: 1673,
    endYear: 1920,
    name: "Физика",
    subData: [
      {
        year: 1673,
        desc: "В 1673 году вышла книга Христиана Гюйгенса «Часы с маятником». В ней Гюйгенс приводит (словесно) ",
      },
      {
        year: 1821,
        desc: "К концу XVIII века в активе физики электромагнитных явлений были уже теория атмосферного электричества",
      },
      {
        year: 1873,
        desc: "Силы, введённые Ампером, как и у Ньютона, считались дальнодействующими",
      },
      {
        year: 1907,
        desc: "В статье 1905 года Эйнштейн рассмотрел два постулата: всеобщий принцип ",
      },
    ],
  },
  {
    startYear: 1673,
    endYear: 1920,
    name: "Экономика",
    subData: [
      {
        year: 1673,
        desc: "В 1673 году вышла книга Христиана Гюйгенса «Часы с маятником». В ней Гюйгенс приводит (словесно) ",
      },
      {
        year: 1821,
        desc: "К концу XVIII века в активе физики электромагнитных явлений были уже теория атмосферного электричества",
      },
      {
        year: 1873,
        desc: "Силы, введённые Ампером, как и у Ньютона, считались дальнодействующими",
      },
      {
        year: 1907,
        desc: "В статье 1905 года Эйнштейн рассмотрел два постулата: всеобщий принцип ",
      },
    ],
  },
  
];
